asrulmunir/bidin-firmware/sdkconfig.defaults
# PAHM Firmware Configuration
# Minimal config for Freenove ESP32-S3 Display 2.8"

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y

# Audio configuration
CONFIG_ESP32_S3_BOX_AUDIO_VERSION_2_8=y
CONFIG_AUDIO_BOARD="freenove-esp32s3-2.8"

# WebSocket configuration  
CONFIG_PAHM_WEBSOCKET_URL="ws://hermes.tetupai.com:8000/xiaozhi/v1/"
CONFIG_PAHM_WEBSOCKET_RECONNECT=y
CONFIG_PAHM_WEBSOCKET_RECONNECT_INTERVAL=5

# Audio settings
CONFIG_AUDIO_SAMPLE_RATE=16000
CONFIG_AUDIO_CHANNELS=1
CONFIG_AUDIO_BITS_PER_SAMPLE=16

# Display settings
CONFIG_DISPLAY_ENABLED=y
CONFIG_DISPLAY_TYPE="ST7789"
CONFIG_DISPLAY_WIDTH=320
CONFIG_DISPLAY_HEIGHT=240

# Minimal logging
CONFIG_LOG_DEFAULT_LEVEL_WARN=y

# Disable unused components
CONFIG_BT_ENABLED=n
CONFIG_BLE_ENABLED=n
CONFIG_BLUEFI_ENABLED=n
CONFIG_MCP_SERVER_ENABLED=n

# Enable I2S audio
CONFIG_I2S_ENABLED=y

# Enable SPIFFS for config storage
CONFIG_SPIFFS_ENABLED=y
